In [1]:
import numpy as np
import pandas as pd
from sklearn.linear_model import LogisticRegression
from statistics import mode
from sklearn import preprocessing

In [2]:
train_df=pd.read_csv('TitanicDatasetTraining.csv')
test_df=pd.read_csv('TitanicDatasetTesting.csv')

In [3]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    668 non-null    int64
 1   Name      668 non-null    object
 2   Sex       668 non-null    object
 3   Age       536 non-null    float64
 4   SibSp     668 non-null    int64
 5   Parch     668 non-null    int64
 6   Ticket    668 non-null    object
 7   Fare      668 non-null    float64
 8   Cabin     154 non-null    object
 9   Embarked  667 non-null    object
 10  Survived  668 non-null    int64
dtypes: float64(2), int64(4), object(5)
memory usage: 57.5+ KB

In [4]:
train_df.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  536.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   14.240257    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   21.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.000000    0.000000    0.000000   14.750000    0.000000
75%      3.000000   38.250000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [5]:
train_df.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [6]:
train_df.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)
test_df.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)

In [7]:
train_df.head()

   Pclass     Sex   Age  SibSp  Parch    Fare Embarked  Survived
0       2  female  29.0      1      0  26.000        S         1
1       3    male   NaN      0      0   8.050        S         0
2       2    male  39.0      0      0  26.000        S         0
3       3  female  29.0      0      4  21.075        S         0
4       3    male  25.0      0      0   7.050        S         0

In [8]:
test_df.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       2    male   8.0      1      1  36.7500        S
1       1  female  49.0      0      0  25.9292        S
2       3    male   NaN      0      0   7.7375        Q
3       2  female  24.0      2      1  27.0000        S
4       1    male  36.0      0      0  26.2875        S

In [9]:
train_df['Age']=train_df['Age'].fillna(train_df['Age'].mean())
test_df['Age']=test_df['Age'].fillna(test_df['Age'].mean())

In [10]:
train_df.Embarked=train_df.Embarked.fillna(mode(train_df.Embarked))
test_df.Embarked=test_df.Embarked.fillna(mode(test_df.Embarked))

In [11]:
def func1(str):
    if(str=="male"):
        return 0
    else:
        return 1

In [12]:
def func2(str):
    if(str=="S"):
        return 1
    elif(str=="Q"):
        return 2
    else:
        return 3

In [13]:
train_df['Sex']=train_df['Sex'].apply(func1)
test_df['Sex']=test_df['Sex'].apply(func1)

In [14]:
train_df['Embarked']=train_df['Embarked'].apply(func2)
test_df['Embarked']=test_df['Embarked'].apply(func2)

In [15]:
train_df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [16]:
test_df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [17]:
train_df['Relatives']=train_df['SibSp']+train_df['Parch']
test_df['Relatives']=test_df['SibSp']+test_df['Parch']
train_df.drop(['SibSp','Parch'],axis=1,inplace=True)
test_df.drop(['SibSp','Parch'],axis=1,inplace=True)

In [18]:
train_df.Age=train_df.Age.round(decimals=0)
test_df.Age=test_df.Age.round(decimals=0)

In [19]:
train_df.Fare=train_df.Fare.round(decimals=0)
test_df.Fare=test_df.Fare.round(decimals=0)

In [20]:
train_df.Fare=(train_df.Fare/train_df.Fare.max())*3

In [21]:
test_df.Fare=(test_df.Fare/test_df.Fare.max())*3

In [22]:
train_df.Age=(train_df.Age/train_df.Age.max())*3

In [23]:
test_df.Age=(test_df.Age/test_df.Age.max())*3

In [24]:
train_df.Relatives=(train_df.Relatives/train_df.Relatives.max())*3

In [25]:
test_df.Relatives=(test_df.Relatives/test_df.Relatives.max())*3

In [26]:
#train_df['A*C']=train_df['Age']*train_df['Pclass']
#train_df['Fare per person']=train_df['Fare']/(train_df['Relatives']+1)

In [27]:
#test_df['A*C']=test_df['Age']*test_df['Pclass']
#test_df['Fare per person']=test_df['Fare']/(test_df['Relatives']+1)

In [28]:
train_df.describe()

,Pclass,Sex,Age,Fare,Embarked,Survived,Relatives
count,668.000000,668.000000,668.000000,668.000000,668.000000,668.000000,668.000000
mean,2.296407,0.360778,1.115850,0.187886,1.473054,0.402695,0.280689
std,0.831638,0.480586,0.478187,0.265593,0.805263,0.490808,0.483182
min,1.000000,0.000000,0.037500,0.000000,1.000000,0.000000,0.000000
25%,2.000000,0.000000,0.862500,0.046875,1.000000,0.000000,0.000000
50%,3.000000,0.000000,1.125000,0.084961,1.000000,0.000000,0.000000
75%,3.000000,1.000000,1.312500,0.181641,2.000000,1.000000,0.300000
max,3.000000,1.000000,3.000000,3.000000,3.000000,1.000000,3.000000

In [29]:
train_df

     Pclass  Sex     Age      Fare  Embarked  Survived  Relatives
0         2    1  1.0875  0.152344         1         1        0.3
1         3    0  1.1250  0.046875         1         0        0.0
2         2    0  1.4625  0.152344         1         0        0.0
3         3    1  1.0875  0.123047         1         0        1.2
4         3    0  0.9375  0.041016         1         0        0.0
..      ...  ...     ...       ...       ...       ...        ...
663       2    1  0.6375  0.058594         1         1        0.0
664       3    0  1.1250  0.046875         2         0        0.0
665       3    0  1.2000  0.328125         1         1        0.0
666       3    1  0.8250  0.058594         1         0        0.0
667       3    1  1.1250  0.093750         2         1        0.3

[668 rows x 7 columns]

In [30]:
test_df

     Pclass  Sex       Age      Fare  Embarked  Relatives
0         2    0  0.338028  0.216797         1        0.6
1         1    1  2.070423  0.152344         1        0.0
2         3    0  1.267606  0.046875         2        0.0
3         2    1  1.014085  0.158203         1        0.9
4         1    0  1.521127  0.152344         1        0.0
..      ...  ...       ...       ...       ...        ...
218       3    0  0.845070  0.046875         1        0.3
219       1    0  1.901408  0.158203         1        0.0
220       1    1  0.718310  0.638672         3        0.3
221       3    0  1.816901  0.035156         1        0.0
222       2    0  1.521127  0.152344         1        0.6

[223 rows x 6 columns]

In [31]:
y_train=train_df['Survived']

In [32]:
train_df.drop('Survived',axis=1,inplace=True)

In [33]:
x_train=np.array(train_df.values.tolist())
x_test=np.array(test_df.values.tolist())

In [34]:
x_train

array([[2.        , 1.        , 1.0875    , 0.15234375, 1.        ,
        0.3       ],
       [3.        , 0.        , 1.125     , 0.046875  , 1.        ,
        0.        ],
       [2.        , 0.        , 1.4625    , 0.15234375, 1.        ,
        0.        ],
       ...,
       [3.        , 0.        , 1.2       , 0.328125  , 1.        ,
        0.        ],
       [3.        , 1.        , 0.825     , 0.05859375, 1.        ,
        0.        ],
       [3.        , 1.        , 1.125     , 0.09375   , 2.        ,
        0.3       ]])

In [35]:
y_train

0      1
1      0
2      0
3      0
4      0
      ..
663    1
664    0
665    1
666    0
667    1
Name: Survived, Length: 668, dtype: int64

In [36]:
alg=LogisticRegression()

In [37]:
alg.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [41]:
y_pred=alg.predict(x_test)

In [42]:
y_pred

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [43]:
print('Training Score:',alg.score(x_train,y_train))
print('Testing Score:',alg.score(x_test,y_pred))

Training Score: 0.7979041916167665
Testing Score: 1.0

In [44]:
np.savetxt('FinalPredictions_LogisticRegression_TitanicDataset.csv', y_pred,fmt='%f')